package model;

/**----------------------------------------------------------------------*
 *■■■BusinessLogicクラス■■■
 *概要：ビジネスロジック（ユーザー登録）
 *----------------------------------------------------------------------**/

public class RegistUserBL {

	/**----------------------------------------------------------------------*
	 *■メソッド
	 *概要　：新規ユーザーを登録する
	 *引数　：ユーザー情報（SurveyDto型）
	 *戻り値：DB操作成功フラグ（true:成功/false:失敗）
	 *----------------------------------------------------------------------**/
	
	public boolean exeInsertUserInfo(UsersInfoDto dto) {

		boolean   succesInsert = false ;  //DB操作成功フラグ（true:成功/false:失敗）

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆対象のユーザーデータを登録するよう依頼
		UsersInfoDao dao = new UsersInfoDao();
		succesInsert = dao.doInsert(dto);

		return succesInsert;

	
	}

}
