package model;

/**----------------------------------------------------------------------*
 *■■■BusinessLogicクラス■■■
 *概要：ビジネスロジック（ネコちゃん情報登録）
 *----------------------------------------------------------------------**/

public class RegistCatBL {
	
	/**----------------------------------------------------------------------*
	 *■メソッド
	 *概要　：新規ネコちゃん情報を登録する
	 *引数　：ネコちゃん情報（CatsInfoDto型）
	 *戻り値：DB操作成功フラグ（true:成功/false:失敗）
	 *----------------------------------------------------------------------**/
	
	public boolean exeInsertCatInfo(CatsInfoDto dto) {

		boolean   succesInsert = false ;  //DB操作成功フラグ（true:成功/false:失敗）

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆対象のユーザーデータを登録するよう依頼
		CatsInfoDao dao = new CatsInfoDao();
		succesInsert = dao.doInsert(dto);

		return succesInsert;

	
	}

	

}
