package model;

/**----------------------------------------------------------------------*
 *Filename:RegistCatBL.java
 *
 *Description:
 *	このクラスは、ネコ情報登録機能を提供するためのものです。
 *	対象のネコ情報を引数として受け取り、
 *	登録する処理を行うメソッドへ渡す。
 *	その後処理の成功フラグを返す
 *
 *Author:大久保
 *Creation Date:2023-09-11
 *
 *Copyright © 2023 KEG Sakura All rights reserved.
 *----------------------------------------------------------------------**/

/**----------------------------------------------------------------------*
 *■■■BusinessLogicクラス■■■
 *概要：ビジネスロジック（ネコちゃん情報登録）
 *----------------------------------------------------------------------**/

public class RegistCatBL {
	
	/**----------------------------------------------------------------------*
	 *■メソッド
	 *概要　：新規ネコちゃん情報を登録する
	 *引数　：ネコちゃん情報（CatsInfoDto型）
	 *戻り値：DB操作成功フラグ（true:成功/false:失敗）
	 *----------------------------------------------------------------------**/
	
	public boolean exeInsertCatInfo(CatsInfoDto dto) {

		boolean   succesInsert = false ;  //DB操作成功フラグ（true:成功/false:失敗）

		//-------------------------------------------
		//データベースへの接続を実施
		//-------------------------------------------

		//DAOクラスをインスタンス化＆対象のユーザーデータを登録するよう依頼
		CatsInfoDao dao = new CatsInfoDao();
		succesInsert = dao.doInsert(dto);

		return succesInsert;

	
	}

	

}
